XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_rcc.c
          case RCC_SYSPLLSRC_USBHSPLL_MUL2_DIV3:
          RCC_Clocks->SYSCLK_Frequency = 320000000;
          break;
  
          case RCC_SYSPLLSRC_ETHPLL_MUL2_DIV3:
          RCC_Clocks->SYSCLK_Frequency = 333000000;
          break;
  
          case RCC_SYSPLLSRC_PLL:
  
            if(pllsource == 0x00) //HSI
            {
                RCC_Clocks->SYSCLK_Frequency = HSI_VALUE*pllmull;
            }
            else 
            {
                RCC_Clocks->SYSCLK_Frequency = HSE_VALUE*pllmull;
            }
            RCC_Clocks->SYSCLK_Frequency /= (1 + Plldiv2);
          break;
  
          default:
          break;
        }
        RCC_Clocks->SYSCLK_Frequency /= presc;
        break;
  
        default:
        RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
        break;
    }
    tmp = HBPrescTable[((RCC->CFGR0 & CFGR0_HPRE_Set_Mask) >> 4)];
    RCC_Clocks->HCLK_Frequency =  RCC_Clocks->SYSCLK_Frequency >> tmp;

    tmp = PBPrescTable[((RCC->CFGR0 & CFGR0_PPRE1_Set_Mask) >> 8)];
    RCC_Clocks->PCLK1_Frequency =  RCC_Clocks->HCLK_Frequency >> tmp;

    tmp = PBPrescTable[((RCC->CFGR0 & CFGR0_PPRE2_Set_Mask) >> 11)];
    RCC_Clocks->PCLK2_Frequency =  RCC_Clocks->HCLK_Frequency >> tmp;

    
    if((RCC->CFGR0 & 0x10000000) == 0x10000000)
    {
        tmp = 480000000/((RCC->CFGR3)+1);
    }
    else
    {
        tmp = RCC_Clocks->HCLK_Frequency;
    }
    tmp1 = tmp >> PBPrescTable[((RCC->CFGR0 & CFGR0_PPRE2_Set_Mask) >> 11)];
    tmp = RCC->CFGR0 & CFGR0_ADCPRE_Set_Mask;
    tmp = tmp >> 14;
    presc = ADCPrescTable[tmp];
    RCC_Clocks->ADCCLK_Frequency = tmp1 / presc;

}

/*********************************************************************
 * @fn      RCC_HBPeriphClockCmd
 *
 * @brief   Enables or disables the HB peripheral clock.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to gates its clock.
 *            RCC_HBPeriph_DMA1.
 *            RCC_HBPeriph_DMA2.
 *            RCC_HBPeriph_SRAM.
 *            RCC_HBPeriph_LTDC
 *            RCC_HBPeriph_PSRAM
 *            RCC_HBPeriph_I3C
 *            RCC_HBPeriph_CRC.
 *            RCC_HBPeriph_ARGB
 *            RCC_HBPeriph_FSMC
 *            RCC_HBPeriph_RNG
 *            RCC_HBPeriph_SDIO
 *            RCC_HBPeriph_USBHS1
 *            RCC_HBPeriph_USBHS2
 *            RCC_HBPeriph_DVP
 *            RCC_HBPeriph_ETH_MAC
 *          Note-
 *          SRAM  clock can be disabled only during sleep mode.
 *          NewState: ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphClockCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HBPCENR |= RCC_HBPeriph;
    }
    else
    {
        RCC->HBPCENR &= ~RCC_HBPeriph;
    }
}

/*********************************************************************
 * @fn      RCC_PB2PeriphClockCmd
 *
 * @brief   Enables or disables the High Speed APB (PB2) peripheral clock.
 *
 * @param   RCC_PB2Periph - specifies the PB2 peripheral to gates its clock.
 *            RCC_PB2Periph_AFIO.
 *            RCC_PB2Periph_GPIOA.
 *            RCC_PB2Periph_GPIOB.
 *            RCC_PB2Periph_GPIOC.
 *            RCC_PB2Periph_GPIOD.
 *            RCC_PB2Periph_GPIOE
 *            RCC_PB2Periph_ADC1.
 *            RCC_PB2Periph_ADC2
 *            RCC_PB2Periph_TIM1.
 *            RCC_PB2Periph_SPI1.
 *            RCC_PB2Periph_TIM8
 *            RCC_PB2Periph_USART1.
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_PB2PeriphClockCmd(uint32_t RCC_PB2Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->PB2PCENR |= RCC_PB2Periph;
    }
    else
    {
        RCC->PB2PCENR &= ~RCC_PB2Periph;
    }
}

/*********************************************************************
 * @fn      RCC_PB1PeriphClockCmd
 *
 * @brief   Enables or disables the Low Speed APB (PB1) peripheral clock.
 *
 * @param   RCC_PB1Periph - specifies the PB1 peripheral to gates its clock.
 *            RCC_PB1Periph_TIM2.
 *            RCC_PB1Periph_TIM3.
 *            RCC_PB1Periph_TIM4.
 *            RCC_PB1Periph_TIM5
 *            RCC_PB1Periph_TIM6
 *            RCC_PB1Periph_TIM7
 *            RCC_PB1Periph_UART6
 *            RCC_PB1Periph_UART7
 *            RCC_PB1Periph_UART8
 *            RCC_PB1Periph_UART9
 *            RCC_PB1Periph_UART10
 *            RCC_PB1Periph_WWDG.
 *            RCC_PB1Periph_SPI2.
 *            RCC_PB1Periph_SPI3.
 *            RCC_PB1Periph_USART2.
 *            RCC_PB1Periph_USART3.
 *            RCC_PB1Periph_USART4
 *            RCC_PB1Periph_USART5
 *            RCC_PB1Periph_I2C.
 *            RCC_PB1Periph_CAN1.
 *            RCC_PB1Periph_BKP.
 *            RCC_PB1Periph_PWR.
 *            RCC_PB1Periph_DAC.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PB1PeriphClockCmd(uint32_t RCC_PB1Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->PB1PCENR |= RCC_PB1Periph;
    }
    else
    {
        RCC->PB1PCENR &= ~RCC_PB1Periph;
    }
}

/*********************************************************************
 * @fn      RCC_PB2PeriphResetCmd
 *
 * @brief   Forces or releases High Speed APB (PB2) peripheral reset.
 *
 * @param   RCC_PB2Periph - specifies the PB2 peripheral to reset.
 *            RCC_PB2Periph_AFIO.
 *            RCC_PB2Periph_GPIOA.
 *            RCC_PB2Periph_GPIOB.
 *            RCC_PB2Periph_GPIOC.
 *            RCC_PB2Periph_GPIOD.
 *            RCC_PB2Periph_GPIOE
 *            RCC_PB2Periph_ADC1.
 *            RCC_PB2Periph_ADC2
 *            RCC_PB2Periph_TIM1.
 *            RCC_PB2Periph_SPI1.
 *            RCC_PB2Periph_TIM8
 *            RCC_PB2Periph_USART1.
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_PB2PeriphResetCmd(uint32_t RCC_PB2Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->PB2PRSTR |= RCC_PB2Periph;
    }
    else
    {
        RCC->PB2PRSTR &= ~RCC_PB2Periph;
    }
}

/*********************************************************************
 * @fn      RCC_PB1PeriphResetCmd
 *
 * @brief   Forces or releases Low Speed APB (PB1) peripheral reset.
 *
 * @param   RCC_PB1Periph - specifies the PB1 peripheral to reset.
 *            RCC_PB1Periph_TIM2.
 *            RCC_PB1Periph_TIM3.
 *            RCC_PB1Periph_TIM4.
 *            RCC_PB1Periph_TIM5
 *            RCC_PB1Periph_TIM6
 *            RCC_PB1Periph_TIM7
 *            RCC_PB1Periph_UART6
 *            RCC_PB1Periph_UART7
 *            RCC_PB1Periph_UART8
 *            RCC_PB1Periph_UART9
 *            RCC_PB1Periph_UART10
 *            RCC_PB1Periph_WWDG.
 *            RCC_PB1Periph_SPI2.
 *            RCC_PB1Periph_SPI3.
 *            RCC_PB1Periph_USART2.
 *            RCC_PB1Periph_USART3.
 *            RCC_PB1Periph_USART4
 *            RCC_PB1Periph_USART5
 *            RCC_PB1Periph_I2C1.
 *            RCC_PB1Periph_CAN1.
 *            RCC_PB1Periph_BKP.
 *            RCC_PB1Periph_PWR.
 *            RCC_PB1Periph_DAC.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PB1PeriphResetCmd(uint32_t RCC_PB1Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->PB1PRSTR |= RCC_PB1Periph;
    }
    else
    {
        RCC->PB1PRSTR &= ~RCC_PB1Periph;
    }
}

/*********************************************************************
 * @fn      RCC_BackupResetCmd
 *
 * @brief   Forces or releases the Backup domain reset.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_BackupResetCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->BDCTLR |= (1 << 16);
    }
    else
    {
        RCC->BDCTLR &= ~(1 << 16);
    }
}

/*********************************************************************
 * @fn      RCC_ClockSecuritySystemCmd
 *
 * @brief   Enables or disables the Clock Security System.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_ClockSecuritySystemCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= (1 << 19);
    }
    else
    {
        RCC->CTLR &= ~(1 << 19);
    }
}

/*********************************************************************
 * @fn      RCC_MCOConfig
 *
 * @brief   Selects the clock source to output on MCO pin.
 *
 * @param   RCC_MCO - specifies the clock source to output.
 *            RCC_MCO_NoClock - No clock selected.
 *            RCC_MCO_SYSCLK - System clock selected.
 *            RCC_MCO_HSI - HSI oscillator clock selected.
 *            RCC_MCO_HSE - HSE oscillator clock selected.
 *            RCC_MCO_UTMI - UTMI clock divided by 2 selected
 *            RCC_MCO_XT1 - External 3-25 MHz oscillator clock selected
 *            RCC_MCO_ETHPLL_Div8 - ETH divided 8 clock selected
 *
 * @return  none
 */
void RCC_MCOConfig(uint8_t RCC_MCO)
{
    *(__IO uint8_t *)CFGR0_BYTE4_ADDRESS = RCC_MCO;
}

/*********************************************************************
 * @fn      RCC_GetFlagStatus
 *
 * @brief   Checks whether the specified RCC flag is set or not.
 *
 * @param   RCC_FLAG - specifies the flag to check.
 *            RCC_FLAG_HSIRDY - HSI oscillator clock ready.
 *            RCC_FLAG_HSERDY - HSE oscillator clock ready.
 *            RCC_FLAG_PLLRDY - PLL clock ready.
 *            RCC_FLAG_LSERDY - LSE oscillator clock ready.
 *            RCC_FLAG_LSIRDY - LSI oscillator clock ready.
 *            RCC_FLAG_PINRST - Pin reset.
 *            RCC_FLAG_PORRST - POR/PDR reset.
 *            RCC_FLAG_SFTRST - Software reset.
 *            RCC_FLAG_IWDGRST - Independent Watchdog reset.
 *            RCC_FLAG_WWDGRST - Window Watchdog reset.
 *            RCC_FLAG_LPWRRST - Low Power reset
 *
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
    uint32_t tmp = 0;
    uint32_t statusreg = 0;

    FlagStatus bitstatus = RESET;
    tmp = RCC_FLAG >> 5;

    if(tmp == 1)
    {
        statusreg = RCC->CTLR;
    }
    else if(tmp == 2)
    {
        statusreg = RCC->BDCTLR;
    }
    else
    {
        statusreg = RCC->RSTSCKR;
    }

