XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_rcc.c
    tmp = RCC_FLAG & FLAG_Mask;

    if((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearFlag
 *
 * @brief   Clears the RCC reset flags.
 *          Note-   
 *          The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_PORRST, RCC_FLAG_SFTRST,
 *          RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LPWRRST
 * @return  none
 */
void RCC_ClearFlag(void)
{
    RCC->RSTSCKR |= RSTSCKR_RMVF_Set;
}

/*********************************************************************
 * @fn      RCC_GetITStatus
 *
 * @brief   Checks whether the specified RCC interrupt has occurred or not.
 *
 * @param   RCC_IT - specifies the RCC interrupt source to check.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_CSS - Clock Security System interrupt.
 *
 * @return  ITStatus - SET or RESET.
 */

ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
    ITStatus bitstatus = RESET;

    if((RCC->INTR & RCC_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearITPendingBit
 *
 * @brief   Clears the RCC's interrupt pending bits.
 *
 * @param   RCC_IT - specifies the interrupt pending bit to clear.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_CSS - Clock Security System interrupt.
 *
 * @return  none
 */
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
    *(__IO uint8_t *)INTR_BYTE3_ADDRESS = RCC_IT;
}

/*********************************************************************
 * @fn      RCC_I2S2CLKConfig
 *
 * @brief   Configures the I2S2 clock source(I2S2CLK).
 *
 * @param   RCC_I2S2CLKSource - specifies the I2S2 clock source.
 *          RCC_I2S2CLKSource_SYSCLK - system clock selected as I2S2 clock entry
 *          RCC_I2S2CLKSource_USBHSPLL - USBHS_PLLclock selected as I2S2 clock entry
 *          RCC_I2S2CLKSource_ETHPLL - ETH_PLLclock selected as I2S2 clock entry
 *           note:ETHPLL/USBHSPLL div4 as I2S2 clock
 * @return  none
 */
void RCC_I2S2CLKConfig(uint8_t RCC_I2S2CLKSource)
{
    if(RCC_I2S2CLKSource == RCC_I2S2CLKSource_USBHSPLL)
    {
        RCC->CFGR2 &=~(1<<7);
        RCC->CFGR2 |= (1<<17);        
    }
    else if(RCC_I2S2CLKSource == RCC_I2S2CLKSource_ETHPLL)
    {
        RCC->CFGR2 |= (1<<7);
        RCC->CFGR2 |= (1<<17);      
    }
    else if(RCC_I2S2CLKSource == RCC_I2S2CLKSource_SYSCLK)
    {
        RCC->CFGR2 &=~(1<<17); 
    }
}

/*********************************************************************
 * @fn      RCC_I2S3CLKConfig
 *
 * @brief   Configures the I2S3 clock source(I2S2CLK).
 *
 * @param   RCC_I2S3CLKSource - specifies the I2S3 clock source.
 *          RCC_I2S3CLKSource_SYSCLK - system clock selected as I2S3 clock entry
 *          RCC_I2S3CLKSource_USBHSPLL - USBHS_PLLclock selected as I2S3 clock entry
 *          RCC_I2S3CLKSource_ETHPLL - ETH_PLLclock selected as I2S3 clock entry
 *          note:ETHPLL/USBHSPLL div4 as I2S3 clock
 * @return  none
 */
void RCC_I2S3CLKConfig(uint8_t RCC_I2S3CLKSource)
{
    if(RCC_I2S3CLKSource == RCC_I2S3CLKSource_USBHSPLL)
    {
        RCC->CFGR2 &=~(1<<7);
        RCC->CFGR2 |= (1<<18);        
    }
    else if(RCC_I2S3CLKSource == RCC_I2S3CLKSource_ETHPLL)
    {
        RCC->CFGR2 |= (1<<7);
        RCC->CFGR2 |= (1<<18);      
    }
    else if(RCC_I2S3CLKSource == RCC_I2S3CLKSource_SYSCLK)
    {
        RCC->CFGR2 &=~(1<<18); 
    }
}

/*********************************************************************
 * @fn      RCC_HBPeriphResetCmd
 *
 * @brief   Forces or releases HB peripheral reset.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to reset.
 *            RCC_HBPeriph_LTDC
 *            RCC_HBPeriph_PSRAM
 *            RCC_HBPeriph_I3C
 *            RCC_HBPeriph_ARGB
 *            RCC_HBPeriph_USBHS1
 *            RCC_HBPeriph_USBHS2
 *            RCC_HBPeriph_DVP
 *            RCC_HBPeriph_ETH_MAC
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphResetCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HBRSTR |= RCC_HBPeriph;
    }
    else
    {
        RCC->HBRSTR &= ~RCC_HBPeriph;
    }
}

/*********************************************************************
 * @fn      RCC_RNGCLKConfig
 *
 * @brief   Configures the RNG clock source.
 *
 * @param   RCC_RNGCLKSource - specifies the RNG clock source.
 *            RCC_RNGCLKSource_SYSCLK - system clock selected as RNG clock entry
 *            RCC_RNGCLKSource_USBHSPLL - USBHSPLL clock selected as RNG clock entry
 *            RCC_RNGCLKSource_ETHPLL- ETHPLL clock selected as RNG clock entry
 * 
 * @return  none
 */
void RCC_RNGCLKConfig(uint8_t RCC_RNGCLKSource)
{
    if(RCC_RNGCLKSource == RCC_RNGCLKSource_USBHSPLL)
    {
        RCC->CFGR2 &=~(1<<7);
        RCC->CFGR2 |= (1<<19);        
    }
    else if(RCC_RNGCLKSource == RCC_RNGCLKSource_ETHPLL)
    {
        RCC->CFGR2 |= (1<<7);
        RCC->CFGR2 |= (1<<19);      
    }
    else if(RCC_RNGCLKSource == RCC_RNGCLKSource_SYSCLK)
    {
        RCC->CFGR2 &=~(1<<19); 
    }
}

/*********************************************************************
 * @fn      RCC_USBHSPLLCLKConfig
 *
 * @brief   Configures the USBHSPLL clock source.
 *
 * @param   RCC_HSBHSPLLCLKSource - specifies the USBHSPLL clock source.
 *            RCC_USBHSPLLCLKSource_HSE - HSE clock selected as USBHSPLL clock entry
 *            RCC_USBHSPLLCLKSource_HSI - HSI clock selected as USBHSPLL clock entry
 *            RCC_USBHSPLLCLKSource_ETHCLK_20 - ETH clock 20M selected as USBHSPLL clock entry
 * @return  none
 */
void RCC_USBHSPLLCLKConfig(uint32_t RCC_USBHSPLLCLKSource)
{

    RCC->CFGR2 &= ~(3 << 26);
    RCC->CFGR2 |= RCC_USBHSPLLCLKSource << 26;
}

/*********************************************************************
 * @fn      RCC_USBHSPLLReferConfig
 *
 * @brief   Configures the USBHSPLL reference clock.
 *
 * @param   RCC_USBHSPLLCKREFCLKSource - Select reference clock.
 *            RCC_USBHSPLLCKREFCLK_25M - reference clock 25Mhz.
 *            RCC_USBHSPLLCKREFCLK_20M - reference clock 20Mhz.
 *            RCC_USBHSPLLCKREFCLK_24M - reference clock 24Mhz.
 *            RCC_USBHSPLLCKREFCLK_32M - reference clock 32Mhz.
 *
 * @return  none
 */
void RCC_USBHSPLLReferConfig(uint32_t RCC_USBHSPLLCKREFCLKSource)
{
    RCC->CFGR2 &= ~(3 << 28);
    RCC->CFGR2 |= RCC_USBHSPLLCKREFCLKSource << 28;
}

/*********************************************************************
 * @fn      RCC_UTMI1cmd
 *
 * @brief   Enable UTMI1 clock gate control.
 *
 * @param   NewState - ENABLE or DISABLE.
 * 
 * @return  none
 */
void RCC_UTMI1cmd(FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->CFGR2 |= (1 << 30);
    }
    else
    {
        RCC->CFGR2 &= ~(1 << 30);
    }
}

/*********************************************************************
 * @fn      RCC_UTMI2cmd
 *
 * @brief   Enable UTMI2 clock gate control.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_UTMI2cmd(FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->CFGR2 |= (1 << 31);
    }
    else
    {
        RCC->CFGR2 &= ~(1 << 31);
    }
}

/*********************************************************************
 * @fn      RCC_ADCCLKSourceUSBHSConfig
 *
 * @brief   Configures the ADC clock (ADCCLK).
 *
 * @param   RCC_CLKDIV - defines the ADC clock divider. This clock is derived from
 *        the USBHSPLL clock .
 *          RCC_CLKDIV1 - ADC clock = USBHSPLL.
 *          RCC_CLKDIV2 - ADC clock = USBHSPLL/2.
 *          RCC_CLKDIV3 - ADC clock = USBHSPLL/3.
 *          RCC_CLKDIV4 - ADC clock = USBHSPLL/4.
 *          RCC_CLKDIV5 - ADC clock = USBHSPLL/5.
 *          RCC_CLKDIV6 - ADC clock = USBHSPLL/6.
 *          RCC_CLKDIV7 - ADC clock = USBHSPLL/7.
 *          RCC_CLKDIV8 - ADC clock = USBHSPLL/8.
 *          RCC_CLKDIV9 - ADC clock = USBHSPLL/9.
 *          RCC_CLKDIV10 - ADC clock = USBHSPLL/10.
 *          RCC_CLKDIV11 - ADC clock = USBHSPLL/11.
 *          RCC_CLKDIV12 - ADC clock = USBHSPLL/12.
 *          RCC_CLKDIV13 - ADC clock = USBHSPLL/13.
 *          RCC_CLKDIV14 - ADC clock = USBHSPLL/14.
 *          RCC_CLKDIV15 - ADC clock = USBHSPLL/15.
 *          RCC_CLKDIV16 - ADC clock = USBHSPLL/16.
 *          RCC_CLKDIV17 - ADC clock = USBHSPLL/17.
 *          RCC_CLKDIV18 - ADC clock = USBHSPLL/18.
 *          RCC_CLKDIV19 - ADC clock = USBHSPLL/19.
 *          RCC_CLKDIV20 - ADC clock = USBHSPLL/20.
 *          RCC_CLKDIV21 - ADC clock = USBHSPLL/21.
 *          RCC_CLKDIV22 - ADC clock = USBHSPLL/22.
 *          RCC_CLKDIV23 - ADC clock = USBHSPLL/23.
 *          RCC_CLKDIV24 - ADC clock = USBHSPLL/24.
 *          RCC_CLKDIV25 - ADC clock = USBHSPLL/25.
 *          RCC_CLKDIV26 - ADC clock = USBHSPLL/26.
 *          RCC_CLKDIV27 - ADC clock = USBHSPLL/27.
 *          RCC_CLKDIV28 - ADC clock = USBHSPLL/28.
 *          RCC_CLKDIV29 - ADC clock = USBHSPLL/29.
 *          RCC_CLKDIV30 - ADC clock = USBHSPLL/30.
 *          RCC_CLKDIV31 - ADC clock = USBHSPLL/31.
 *          RCC_CLKDIV32 - ADC clock = USBHSPLL/32.
 *
 * @return  none
 */
void RCC_ADCClockSourceUSBHSConfig(uint32_t RCC_CLKDIV)
{
    uint32_t tmpreg = 0;
    tmpreg = RCC->CFGR3;
    tmpreg &= CFGR3_ADCPRE_Reset_Mask;
    tmpreg |= RCC_CLKDIV;
    RCC->CFGR3 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_SYSPLLConfig
 *
 * @brief   Configures the System PLL clock source.
 *
 * @param   RCC_SYSPLLClockSource - the System PLL clock source.
 *            RCC_SYSPLLClockSource_PLL - PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_USBHSPLL - USBHS PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_ETHPLL - ETH PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_USBHS_Mul2_Div3 - SERDES PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_ETH_Mul2_Div3 - USBSS PLL clock selected as System PLL clock entry
 *
 * @return  none
 */
void RCC_SYSPLLConfig(uint32_t RCC_SYSPLLClockSource)
{
    RCC->CFGR2 &= ~RCC_SYSPLLSRC;
    RCC->CFGR2 |= (RCC_SYSPLLClockSource << 13);
}

/*********************************************************************
 * @fn      RCC_SYSPLLGATEcmd
 *
 * @brief   ENABLE or DISABLE System clock  gate.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_SYSPLLGATEcmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CFGR2 |= RCC_SYSPLL_GATE;
    }
    else
    {
        RCC->CFGR2 &= ~RCC_SYSPLL_GATE;
    }
}

/*********************************************************************
 * @fn      RCC_ADCCLKSourceConfig
 *
 * @brief   Configures the ADC clock source.
 *
 * @param   RCC_ADCCLKSourceConfig - specifies the ADC clock source.
 *            RCC_ADCCLKSource_HCLK -  HCLK clock selected as ADC clock entry
 *            RCC_ADCCLKSource_USBHSPLL - USBHS PLL clock selected as ADC clock entry
 *
 * @return  none
 */
void RCC_ADCCLKSourceConfig(uint32_t RCC_ADCCLKSource)
{
    RCC->CFGR0 &= ~RCC_CFGR0_ADCSRC;
    RCC->CFGR0 |= (RCC_ADCCLKSource << 28);
}

/*********************************************************************
 * @fn      RCC_ADCCLKDutyCycleConfig
 *
 * @brief   Configures the ADC clock high level duty cycle.
 *
 * @param   RCC_DutyCycle - high level duty cycle.
 *            RCC_DutyCycle_50 - ADC clock 50% duty cycle .
 *            RCC_DutyCycle_62_5 -ADC clock 62_5% duty cycle ..
 *            RCC_DutyCycle_75 -ADC clock 75% duty cycle ..
 *
 * @return  none
 */
void RCC_ADCCLKDutyCycleConfig(uint32_t RCC_DutyCycle)
{
    RCC->CFGR0 &= ~RCC_ADC_DUTY_SEL;
    RCC->CFGR0 |= RCC_DutyCycle;
}

/*********************************************************************
 * @fn      RCC_LTDCCLKConfig
 *
 * @brief   Configures the LTDC clock source.
 *
 * @param   RCC_LTDCClockSource - the LTDC clock source.
 *            RCC_LTDCClockSource_ETHPLL - ETH PLL clock selected as LTDC clock entry
 *            RCC_LTDCClockSource_USBHSPLL - USBHS PLL clock selected as LTDC clock entry
 *
 * @return  none
 */
void RCC_LTDCCLKConfig(uint32_t RCC_LTDCClockSource)
{
    RCC->CFGR3 &= ~RCC_LTDCSRC;
    RCC->CFGR3 |= (RCC_LTDCClockSource << 6);
}

/*********************************************************************
 * @fn      RCC_LTDCClockSourceDivConfig
 *
 * @brief   Configures the LTDC clock Source Division.
 *
 * @param   RCC_LTDCClockSource_Div - the LTDC clock Source Division
 *            RCC_LTDCClockSource_Divx - x can select(1~64)
 *
 * @return  none
 */
void RCC_LTDCClockSourceDivConfig(uint32_t RCC_LTDCClockSource_Div)
{
    RCC->CFGR3 &= ~RCC_LTDCDIV;
    RCC->CFGR3 |= RCC_LTDCClockSource_Div << 0;
}